//
//  DataInRussian.swift
//  HSE Sharing
//
//  Created by Екатерина on 23.02.2022.
//

import Foundation

struct DataInRussian {
    
    static let categories = ["Учеба", "Не учеба"]
    
    static let subcategoriesStudy = [
        "Другое",
        "Языки",
        "Программирование",
        "Экономика",
        "Математика",
        "Работа с текстом",
        "Литература",
        "Обществознание",
        "Искусство",
        "Психология",
        "История",
        "Естествознание",
        "Презентации"
    ];
    
    static let subcategoriesNonStudy = [
        "Другое",
        "Транспорт",
        "Развлечения",
        "Съемка/монтаж",
        "Кулинария",
        "Компьютеры",
        "Красота",
        "Товары",
        "Быт"
    ];
    
    static let gender = ["-", "Мужской", "Женский"];
    
    static let statuses = ["Может", "Хочет"];
    
    static let eduPrograms = [
        "-",
        "Городское планирование",
        "Клеточная и молекулярная биотехнология",
        "Арабистика: язык, словесность, культура",
        "Востоковедение",
        "Христианский Восток",
        "Язык, словесность и культура Китая",
        "Дизайн",
        "Мода",
        "Информатика и вычислительная техника",
        "Программная инженерия",
        "Информационная безопасность",
        "Компьютерная безопасность",
        "История искусств",
        "Современное искусство",
        "Античность",
        "История",
        "Культурология",
        "Компьютерные науки и анализ данных",
        "Математика",
        "Прикладная математика",
        "Прикладная математика и информатика",
        "Программа двух дипломов НИУ ВШЭ и Лондонского университета «Прикладной анализ данных»",
        "Совместный бакалавриат НИУ ВШЭ и ЦПМ",
        "Прикладной анализ данных",
        "География глобальных изменений и геоинформационные технологии",
        "Международные отношения",
        "Политология",
        "Программа двух дипломов НИУ ВШЭ и Лондонского университета по международным отношениям",
        "Программа двух дипломов НИУ ВШЭ и Университета Кёнхи «Экономика и политика в Азии»",
        "Психология",
        "Социология",
        "Журналистика",
        "Медиакоммуникации",
        "Реклама и связи с общественностью",
        "Физика",
        "Философия",
        "Химия",
        "Бизнес-информатика",
        "Государственное и муниципальное управление",
        "Логистика и управление цепями поставок",
        "Маркетинг и рыночная аналитика",
        "Мировая экономика",
        "Программа двух дипломов по экономике НИУ ВШЭ и Лондонского университета",
        "Совместная программа по экономике НИУ ВШЭ и РЭШ",
        "Управление бизнесом",
        "Цифровые инновации в управлении предприятием",
        "Экономика",
        "Экономика и статистика",
        "Инфокоммуникационные технологии и системы связи",
        "Юриспруденция",
        "Юриспруденция: частное право",
        "Иностранные языки и межкультурная коммуникация",
        "Филология",
        "Фундаментальная и компьютерная лингвистика"
    ];
    
    static let dormitories = [
        "-",
        "Общежитие 1",
        "Общежитие 2",
        "Общежитие 3",
        "Общежитие 4",
        "Общежитие 5",
        "Общежитие 6",
        "Общежитие 7",
        "Трилистник(8)",
        "Общежитие 9",
        "Общежитие 10",
        "Общежитие 11",
        "Дубки"
    ];
    
    static let universityCampuses = [
        "-",
        "Мясницкая",
        "Покровка",
        "Шаболовка",
        "Басманная",
        "Другое"
    ];
    
    static let stagesOfEdu = [
        "-",
        "Бакаклавриат 1 курс",
        "Бакаклавриат 2 курс",
        "Бакаклавриат 3 курс",
        "Бакаклавриат 4 курс",
        "Бакаклавриат 5 курс",
        "Магистратура 1 курс",
        "Магистратура 2 курс"
    ];
    
    static let sectors = [
        "Текущие",
        "Исходящие",
        "Входящие",
        "Завершенные"
    ]
}
